function initMap() {
  var lat = 24.47921264038164;
  var lng = 39.645764095799095;
  const myLatlng = { lat: lat, lng: lng };
  const map = new google.maps.Map(document.getElementById("map"), {
    zoom: 17,
    center: myLatlng,
    draggable: false
  });

  var content = `<div class="map-branch">
<div class="branch-img">
<img src="../images/logo-map.png" class="img-fluid" />
</div>
<div class="branch-info">
<span>العنوان</span>
<h3 class="branch-title">
مركز طابة الأعمال, شارع الأمير محمد بن عبد العزيز, العريض, 42314 المدينة المنورة
</h3>
<div class="branch-tools">
<a href="#!" class="branch-directions">
<svg width="20" height="20" viewBox="0 0 20 20"  xmlns="http://www.w3.org/2000/svg">
<path
    d="M19.705 9.29494L10.705 0.294941C10.315 -0.0950586 9.68 -0.0950586 9.295 0.294941L0.295002 9.29494C-0.0949976 9.68494 -0.0949976 10.3199 0.295002 10.7099L9.295 19.7049V19.7099C9.685 20.0999 10.32 20.0999 10.71 19.7099L19.71 10.7099C20.1 10.3149 20.1 9.68494 19.705 9.29494ZM12 12.4999V9.99994H8V12.9999H6V8.99994C6 8.44494 6.445 7.99994 7 7.99994H12V5.49994L15.5 8.99994L12 12.4999Z"
     />
</svg>


  استكشف الوجهة
</a>
<a href="tel:+966920002678" class="branch-phone">
<svg width="28" height="27" viewBox="0 0 28 27" xmlns="http://www.w3.org/2000/svg">
<path fill-rule="evenodd" clip-rule="evenodd"
    d="M6.39848 10.1383L8.17112 9.48364C8.17112 9.48364 9.53746 12.2186 12.235 14.9277C14.9325 17.6367 17.9187 19.1066 17.9187 19.1066L17.1536 20.9047C17.1536 20.9047 13.7907 18.9498 11.0104 16.1576C8.2301 13.3655 6.39848 10.1383 6.39848 10.1383ZM26.2217 18.6068C27.4223 19.2063 27.6834 20.8119 26.7353 21.7641L22.6714 25.8453C22.3759 26.1424 22.0146 26.365 21.6171 26.495C21.2195 26.6249 20.797 26.6586 20.384 26.5933C20.1067 26.5491 19.8304 26.499 19.5552 26.4431C17.0743 26.1048 12.1936 24.836 7.50204 20.1242C2.5497 15.1507 1.13758 9.57907 0.738863 7.04136C0.673756 6.62663 0.707271 6.20232 0.83667 5.80308C0.966069 5.40385 1.18768 5.04102 1.4834 4.74424L5.5475 0.662866C6.49556 -0.289339 8.09435 -0.0270312 8.69135 1.17874L11.8279 7.51361L10.2603 8.29104L7.35319 2.37774C7.1843 2.03429 6.72951 1.95899 6.4598 2.22985L3.13209 5.57169C2.96027 5.74425 2.82589 5.95066 2.73739 6.17793C2.64888 6.4052 2.60819 6.64841 2.61785 6.89225C2.67458 8.33805 3.10063 11.1164 5.17856 14.4665C6.03216 15.7451 7.14077 17.1243 8.58144 18.5712C13.5651 23.5762 18.0794 24.5445 20.248 24.6904C20.5434 24.6845 20.7757 24.6632 20.938 24.6425C21.1524 24.6152 21.3611 24.5481 21.544 24.4326C21.6538 24.3633 21.7556 24.2818 21.8473 24.1898L25.1751 20.8479C25.4449 20.577 25.3698 20.1202 25.0279 19.9507L19.1396 17.0311L19.9135 15.4566L26.2217 18.6068Z" />
</svg>

</a>
</div>
</div>
</div>`;

  const infowindow = new google.maps.InfoWindow({
    content: content,
  });

  const marker = new google.maps.Marker({
    position: myLatlng,
    map,
    icon: "",
  });
  infowindow.open({
    anchor: marker,
    map,
    shouldFocus: false,
  });
  marker.addListener("click", () => {
    infowindow.open(map, marker);
  });
}
